---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyString
source: html/0ffc4c34-1991-9ab1-819a-13c6ee5b0330.htm
---
# AssetPropertyString Members

Adds a new connected asset attached to this asset property, if it allows it.